* Part 1
#+begin_src emacs-lisp :var input=input
(setq input (string-trim input))

(defun aoc226/find-first-byte (stream distinct-characters)
  "returns the offset at which the first new packet is started"
  (let ((buffer '())
        (offset 0)
        (end nil))
    (while (not end)
      (progn
        (let ((char (aref stream offset))
              (position (member (aref stream offset) buffer)))
          (if (not position)
              (progn
                ; character not in buffer
                (setq buffer (append buffer (list char)))
                (setq offset (1+ offset)))
            (progn
              ; character in buffer, reset
              (setq offset (- offset (- (length buffer) (length position))))
              (setq buffer (cdr position)))))
        (setq end (cond ((= (1+ offset) (length stream)) t) ; reached end of stream
                        ((= distinct-characters (length buffer)) t) ; we've got 4 characters in buffer
                        (nil))))) ; continue
      (if (= distinct-characters (length buffer))
          offset
        nil)))

(aoc226/find-first-byte input 4)              
#+end_src

#+begin_src emacs-lisp :var input=input
(aoc226/find-first-byte input 14)              
#+end_src
#+RESULTS:
: 3697
